In [3]:
import pandas as pd

print(pd.__version__)

'''
pandas tabublar format date(table,spreadsheet)
Series =single colum data [sahdsaj]
Data Frame= full table data
'''

data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

2.3.0
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
#Creating pandas Dataframe

#manually data entry
#Data structure list, tuple, dictionary, set

data={
    'Name':['Alia','Sita','Ram'],
    'Gender':['F','F','M'],
    'Age':[30,20,23],
    'City':['Mumbai','Janakpur','Aayothya']
}

print(data)
df=pd.DataFrame(data)
print(df)

{'Name': ['Alia', 'Sita', 'Ram'], 'Gender': ['F', 'F', 'M'], 'Age': [30, 20, 23], 'City': ['Mumbai', 'Janakpur', 'Aayothya']}
   Name Gender  Age      City
0  Alia      F   30    Mumbai
1  Sita      F   20  Janakpur
2   Ram      M   23  Aayothya

In [ ]:


data={
    'Name':['Alia','Sita','Ram'],
    'Gender':['F','F','M'],
    'Age':[30,20,23],
    'City':['Mumbai','Janakpur','Aayothya']
}
df=pd.DataFrame(data)
df.to_csv('sample.csv', index=False)
pd.read_csv('sample.csv')

   Unnamed: 0  Name Gender  Age      City
0           0  Alia      F   30    Mumbai
1           1  Sita      F   20  Janakpur
2           2   Ram      M   23  Aayothya

In [4]:
# pd.read_excel('abc.xlsr',sheet_name='Sheet1')

# df.to_excel('output.xlsr',index=False)

In [8]:

#Data correction and modification

data1={
    'Name':['Alia','Sita',None],
    'Gender':['F','F','M'],
    'Age':[30,None,23],
    'City':[None,'Janakpur','Aayothya']
}
df=pd.DataFrame(data1)

print('...........')
df2=df.dropna() #Drop null values
print(df2)

...........
Empty DataFrame
Columns: [Name, Gender, Age, City]
Index: []

In [9]:
print('...........')
df3=df.fillna(0)
print(df3)

...........
   Name Gender   Age      City
0  Alia      F  30.0         0
1  Sita      F   0.0  Janakpur
2     0      M  23.0  Aayothya

In [10]:
print('...........')
df4=df.drop_duplicates()
print(df4)
print('...........')

...........
   Name Gender   Age      City
0  Alia      F  30.0      None
1  Sita      F   NaN  Janakpur
2  None      M  23.0  Aayothya
...........

In [ ]:
#Rename columns

df.rename(columns={'Name':'ActressName'},inplace=True)
print(df)
print('...........')

  ActressName Gender   Age      City
0        Alia      F  30.0      None
1        Sita      F   NaN  Janakpur
2        None      M  23.0  Aayothya
...........

In [ ]:
df = pd. DataFrame ({
'Name': ['Alice', 'Bob' , 'Charlie' , 'David' ],
'Age': [25, 17, 35, 40],
'City': ['NY' , 'LA' , 'Chicago' , 'NY' ]
})

print(df)
print('...........')

adults=df[df['Age']>18]
print(adults)
print('...........')

      Name  Age     City
0    Alice   25       NY
1      Bob   17       LA
2  Charlie   35  Chicago
3    David   40       NY
...........
      Name  Age     City
0    Alice   25       NY
2  Charlie   35  Chicago
3    David   40       NY
...........

In [15]:
df.sort_values(by='Age',ascending=False,inplace=True)
print(df)

      Name  Age     City
3    David   40       NY
2  Charlie   35  Chicago
0    Alice   25       NY
1      Bob   17       LA

In [16]:
print(df['Age'].mean())
print('...........')
print(df['City'].value_counts())

29.25
...........
City
NY         2
Chicago    1
LA         1
Name: count, dtype: int64

In [19]:
print(df.shape)
print('...........')
print(df.head(1))
print('...........')
print(df.tail(2))
print('...........')

(4, 3)
...........
    Name  Age City
3  David   40   NY
...........
    Name  Age City
0  Alice   25   NY
1    Bob   17   LA
...........

In [18]:
print(df.sample(3))
print('...........')
print(df.isnull())
print('...........')
print(df.isnull().sum())
print('...........')

      Name  Age     City
1      Bob   17       LA
2  Charlie   35  Chicago
0    Alice   25       NY
...........
    Name    Age   City
3  False  False  False
2  False  False  False
0  False  False  False
1  False  False  False
...........
Name    0
Age     0
City    0
dtype: int64
...........

In [20]:
df1=df.dropna()
print(df1.shape)
print('...........')

df2=df.dropna(axis=1, thresh=df.shape[0]*0.5)
print(df.shape)
print('...........')
#print(df.dropna('City'))

(4, 3)
...........
(4, 3)
...........